#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/smile-web-system/gh-actions-smile/runs/run-dtE16RYbJSEe6a3y

Waiting for the plan to start...

Terraform v1.1.9
on linux_amd64
Initializing plugins and modules...
random_pet.lambda_bucket_name: Refreshing state... [id=learn-terraform-functions-gently-marginally-amused-wildcat]
aws_s3_bucket.lambda_bucket: Refreshing state... [id=learn-terraform-functions-gently-marginally-amused-wildcat]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_s3_bucket.lambda_bucket has been deleted
  - resource "aws_s3_bucket" "lambda_bucket" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::learn-terraform-functions-gently-marginally-amused-wildcat" -> null
      - bucket                      = "learn-terraform-functions-gently-marginally-amused-wildcat" -> null
      - bucket_domain_name          = "learn-terraform-functions-gently-marginally-amused-wildcat.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "learn-terraform-functions-gently-marginally-amused-wildcat.s3.amazonaws.com" -> null
      - force_destroy               = true -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "learn-terraform-functions-gently-marginally-amused-wildcat" -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags_all                    = {} -> null

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.lambda_bucket will be created
  + resource "aws_s3_bucket" "lambda_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "learn-terraform-functions-gently-marginally-amused-wildcat"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ lambda_bucket_name = "learn-terraform-functions-gently-marginally-amused-wildcat" -> (known after apply)

```
</details>
*Pusher: @leonfloch, Action: `pull_request`*